20221130120900-mech_6040_report.tex
% Created 2022-12-01 Thu 10:21
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[latin1]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\date{\today}
\title{mech 6040 report}
\hypersetup{
 pdfauthor={},
 pdftitle={mech 6040 report},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.1 (Org mode 9.5.2)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{Formatting}
\label{sec:org7ed4d4c}
\begin{itemize}
\item 10-15 page limit
\item title page
\item 8-12 body pages
\item 1 ref page
\end{itemize}

\section{Title Page}
\label{sec:org4df4ac0}
\begin{itemize}
\item Course
\item Project Title
\item Figure
\item Student Name
\item Date \& Signature?
\end{itemize}

\section{Main Body}
\label{sec:orgb091496}
\begin{itemize}
\item walk reader through
\item dos and donts - present within each component blurb
\item problems and solutions - present wihtin each component blurb
\end{itemize}

\subsection{Formatting}
\label{sec:orgdd1802a}
\begin{itemize}
\item 10-13 pages
\item 1000-2000 word
\item 10-12 FIgures
\end{itemize}

\subsection{How to}
\label{sec:orga8a0eb3}

\subsubsection{Assembly}
\label{sec:org81558a2}
\begin{itemize}
\item great place for exploded diagram idenifying components
\item lego axel lengths!
\end{itemize}

\begin{enumerate}
\item Rotating Assembly
\label{sec:org02a0fe5}
\begin{itemize}
\item assemble one flap wheel ot lego shaft
\item assemble second flap wheel and ensure both flap wheel holes align by temprarily mating both components
\item remove one flap wheel, noting its orientation on the lego axis
\item insert large spacer between both flap wheels and replace second flap wheel
\item insert individual flaps by exploiting flap compliance, flaps shoudl snap into place with low applied force
\item assemble the 11mm spacer outside the flap wheel assembly, followed by the worm folloer gear
\item assemble a 1mm spacer on the opposing side of the flap wheel assembly
\item to complete the rotating assembly, assemble a 2mm spacer outside the worm follower gear
\end{itemize}

\item Shell
\label{sec:org18a545d}
\begin{itemize}
\item assemble the round bevel gear mount and worm gear mounts by pressing into the right shell half
\item where are they pressed in!
\item assemble the worm, straddled by two 1mm spacers between both worm mounts and peirce with a lego axle
\item stack the remaining bevel gear, 1mm spacer, c-bevel mount and handle, ensuring that the c-bevel mount ends curl towards the bevel gear
\item peice the stacked components with a lego axle
\item press the bevel gear assembly into the holes above and below the round bevel gear mount
\item assemble the 4mm spacer and one bevel gear respectively to the worm axle end nearest the bevel gear mount, ensuring bevel gear meshes with other
\end{itemize}

\item Final
\label{sec:orgbd77c32}
\begin{itemize}
\item insert axle end or rotating assembly with worm follower gear into the centre hole in right side shell, careful to mate worm with worm follower gear
\item assmeble left shell half to opposing end of rotating assembly shaft
\item insert connectors into top and bottom, mating shell halves
\item insert top (long) and bottom (short) stops into shell cutouts near top and bottom
\end{itemize}
\end{enumerate}

\subsection{Build Steps}
\label{sec:org10aaa21}
\begin{itemize}
\item make small and expandable
\item note lego axis fits for each lego compatible component
\item define different fits/offsets in one place, concerning lego axle and typical components, to be referenced later in component blurbs
\end{itemize}

\subsubsection{Roating Flap Assembly}
\label{sec:org369ddd9}

\begin{enumerate}
\item Flaps/Flap Wheels
\label{sec:org1b9af3e}
\begin{itemize}
\item fittment in holes
\item interactions with other flaps
\item flap wheel spacing vs extrusion width
\item more flaps, smoother action
\item flap number origin (30 LCD with 12 and 6)
\item flap layering
\item thicknesses, too thick, too thin
\item font aspect driving flap shape
\end{itemize}

\item Spacer
\label{sec:orgd5fa406}
\begin{itemize}
\item trailing for flap falling
\end{itemize}

\item Worm Gear
\label{sec:org88e9ace}
\begin{itemize}
\item 30 teeth, 30 flaps
\item clearances iterated to acheive minimal backlash/good feel
\end{itemize}
\end{enumerate}

\subsubsection{Drivetrain}
\label{sec:org1e68af4}

\begin{enumerate}
\item Worm
\label{sec:org36dcff0}
\begin{itemize}
\item overhang performance, teeth bias, did not affect performance
\item some cleanup required
\item taller/longer worms failed
\item video ref
\item loose lego fit for easy sliding
\item interated gear instead of worm as printing worm was challenging/did not always succeed
\end{itemize}

\item Thrust bearings/spacers
\label{sec:orgcd6b2c9}
\begin{itemize}
\item run on smaller surface = reduced friction
\item gap is smaller for worm than total length of worm and spacers to limit looseness
\end{itemize}

\item Bevels
\label{sec:orge8ee5af}
\begin{itemize}
\item failed initially due to lack of support outside
\item video ref
\item sizing minimal to round corner
\end{itemize}

\item Handle
\label{sec:orgc1eb78f}
\begin{itemize}
\item simple lego compatible handle
\item designed for tight fit
\end{itemize}
\end{enumerate}

\subsubsection{Shell}
\label{sec:org187371a}
\begin{itemize}
\item designed for viewing, adequate regidity and easy assembly
\end{itemize}

\begin{enumerate}
\item Connectors
\label{sec:org3b0b746}
\begin{itemize}
\item shell connectors are a little shorter to keep them from coming out
\item tension the rotating assembly eliminating wobble
\end{itemize}

\item Stops
\label{sec:org6a6e6d1}
\begin{itemize}
\item initally designed to be adjustable
\item measured and installed in shell slots
\end{itemize}

\item Sides
\label{sec:orgeb58cc6}
\begin{itemize}
\item sides are fenestrated for easy viewing of assembly/motion
\item cutouts for connectors are offset slightly, non-interference fit
\end{itemize}

\item Bevel holder and nub
\label{sec:orge660f46}
\begin{itemize}
\item initally did not work as planned with single support
\item added small support, interference press fit both components into side
\end{itemize}

\item Worm Mounts
\label{sec:org38eecd0}
\begin{itemize}
\item reduce complexity of shell sides
\item did not want to print rotational interfacing holes vertically due to warping
\item press fit/interference fit but still can be disassembled
\end{itemize}
\end{enumerate}

\subsection{Technical Drawings}
\label{sec:orge357887}

\subsection{Exploded Diagrams}
\label{sec:orga59c97c}

\subsection{Photos}
\label{sec:org7d65d02}

\subsection{Performance}
\label{sec:orgf67a789}
\end{document}
%%% Local Variables:
%%% mode: latex
%%% TeX-master: t
%%% End:
